{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "LocalizeTable",
			"Children": [
				{
					"Source":
					{
						"Text": "LOCALIZATION SAMPLE"
					},
					"Translation":
					{
						"Text": "<TitleText>نموذج الترجمة</>"
					},
					"Key": "TitleLabel"
				},
				{
					"Source":
					{
						"Text": "Music"
					},
					"Translation":
					{
						"Text": "<BigText>موسيقى</>"
					},
					"Key": "MusicLabel"
				},
				{
					"Source":
					{
						"Text": "Select language"
					},
					"Translation":
					{
						"Text": "<BigText>اختار اللغة</>"
					},
					"Key": "SelectLabel"
				},
				{
					"Source":
					{
						"Text": "Sound"
					},
					"Translation":
					{
						"Text": "<BigText>الصوت</>"
					},
					"Key": "SoundLabel"
				},
				{
					"Source":
					{
						"Text": "There are <ItalicText>many</> ways to implement localization in <ColoredText>NoesisGUI</>. In this example we are using our <ColoredItalicText>LocTable</> markup extension to integrate with Unreal localization system where we defined localized texts for each label. Each time the language is changed, the displayed text is updated accordingly. The <ColoredItalicText>RichText</> attached property for <ItalicText>TextBlocks</> allows you to use Unreal styles and images in your text."
					},
					"Translation":
					{
						"Text": "<BigText>توجد طرق عديدة لتنفيذ الترجمة في </><BigColoredText>NoesisGUI</><BigText>. في هذا المثال ، نستخدم ملحق ترميز </><BigColoredItalicText>LocTable</><BigText> الخاص بنا للتكامل مع نظام التعريب غير الواقعي حيث حددنا النصوص المترجمة لكل تسمية. في كل مرة يتم فيها تغيير اللغة ، يتم تحديث النص المعروض وفقًا لذلك. تتيح لك خاصية </><BigColoredItalicText>RichText</><BigText> المرفقة لـ </><BigItalicText>TextBlocks</><BigText> استخدام أنماط</> وصور غير حقيقية في النص الخاص بك."
					},
					"Key": "DescLabel"
				}
			]
		}
	]
}